app/controllers/notes_controller.rb

  def index
    @notes = Note.all
---
SELECT * FROM `notes`

  def create
    note = Note.new(params[:note])
    if note.save
---
INSERT INTO `notes` (`x_pos`, `background`, `content`, `y_pos`, `z_pos`) VALUES(NULL, NULL, NULL, NULL, NULL)

  def destroy
    note = Note.find(params[:id])
    note.destroy
---
SELECT * FROM `notes` WHERE (`notes`.`id` = 11)
DELETE FROM `notes` WHERE `id` = 11

  def update_all
    params[:notes].each do |n|
      @note = Note.find_by_id(n["id"])
      if @note.update_attributes(n)
---
SELECT * FROM `notes` WHERE (`notes`.`id` = '24') LIMIT 1
UPDATE `notes` SET `content` = 'wla lang...', `y_pos` = 215, `background` = 'rgb(115, 196, 235)', `x_pos` = 620 WHERE `id` = 1